Table of Contents
 Class ArcSegment2D
Namespace
IdeaRS.OpenModel.Geometry2D
Assembly
IdeaRS.OpenModel.dll
Represents an arc segment in two-dimensional space.
[OpenModelClass("CI.Geometry2D.CircularArcSegment2D,CI.Geometry2D")]
[DataContract]
public class ArcSegment2D : Segment2D
Inheritance
object
OpenObject
Segment2D
ArcSegment2D
Inherited Members
 Segment2D.EndPoint
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Point
Gets or sets the point of circular arc somewhere between start and end point.
[DataMember]
public Point2D Point { get; set; }
Property Value
Point2D
 Edit this page